PatternAgents/Arduino_Boards/patternagents/esp8266/boards.txt
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.FlashSize=Flash Size
menu.FlashFreq=Flash Frequency

##############################################################
generic.name=Generic ESP8266 Module

generic.upload.tool=esptool
generic.upload.speed=115200
generic.upload.resetmethod=ck
generic.upload.maximum_size=524288
generic.upload.wait_for_upload_port=true
generic.serial.disableDTR=true
generic.serial.disableRTS=true

generic.build.mcu=esp8266
generic.build.f_cpu=80000000L
generic.build.board=ESP8266_ESP01
generic.build.core=esp8266
generic.build.variant=generic
generic.build.flash_mode=qio
generic.build.flash_size=512K
generic.build.flash_freq=40
generic.build.flash_ld=eagle.flash.512k.ld
generic.build.spiffs_start=0x6B000
generic.build.spiffs_end=0x7B000

generic.menu.CpuFrequency.80=80 MHz
generic.menu.CpuFrequency.80.build.f_cpu=80000000L
generic.menu.CpuFrequency.160=160 MHz
generic.menu.CpuFrequency.160.build.f_cpu=160000000L

generic.menu.UploadSpeed.115200=115200
generic.menu.UploadSpeed.115200.upload.speed=115200
generic.menu.UploadSpeed.9600=9600
generic.menu.UploadSpeed.9600.upload.speed=9600
generic.menu.UploadSpeed.57600=57600
generic.menu.UploadSpeed.57600.upload.speed=57600
generic.menu.UploadSpeed.256000.windows=256000
generic.menu.UploadSpeed.256000.upload.speed=256000
generic.menu.UploadSpeed.230400.linux=230400
generic.menu.UploadSpeed.230400.macosx=230400
generic.menu.UploadSpeed.230400.upload.speed=230400
generic.menu.UploadSpeed.460800.linux=460800
generic.menu.UploadSpeed.460800.macosx=460800
generic.menu.UploadSpeed.460800.upload.speed=460800
generic.menu.UploadSpeed.512000.windows=512000
generic.menu.UploadSpeed.512000.upload.speed=512000
generic.menu.UploadSpeed.921600=921600
generic.menu.UploadSpeed.921600.upload.speed=921600

generic.menu.FlashSize.512K=512K (64K SPIFFS)
generic.menu.FlashSize.512K.build.flash_size=512K
generic.menu.FlashSize.512K.build.flash_ld=eagle.flash.512k.ld
generic.menu.FlashSize.512K.build.spiffs_start=0x6B000
generic.menu.FlashSize.512K.build.spiffs_end=0x7B000
generic.menu.FlashSize.1M512=1M (512K SPIFFS)
generic.menu.FlashSize.1M512.build.flash_size=1M
generic.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
generic.menu.FlashSize.1M512.build.spiffs_start=0x6B000
generic.menu.FlashSize.1M512.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M256=1M (256K SPIFFS)
generic.menu.FlashSize.1M256.build.flash_size=1M
generic.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
generic.menu.FlashSize.1M256.build.spiffs_start=0xAB000
generic.menu.FlashSize.1M256.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M128=1M (128K SPIFFS)
generic.menu.FlashSize.1M128.build.flash_size=1M
generic.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
generic.menu.FlashSize.1M128.build.spiffs_start=0xCB000
generic.menu.FlashSize.1M128.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M64=1M (64K SPIFFS)
generic.menu.FlashSize.1M64.build.flash_size=1M
generic.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
generic.menu.FlashSize.1M64.build.spiffs_start=0xEB000
generic.menu.FlashSize.1M64.build.spiffs_end=0xFB000
generic.menu.FlashSize.2M=2M (1M SPIFFS)
generic.menu.FlashSize.2M.build.flash_size=2M
generic.menu.FlashSize.2M.build.flash_ld=eagle.flash.2m.ld
generic.menu.FlashSize.2M.build.spiffs_start=0x100000
generic.menu.FlashSize.2M.build.spiffs_end=0x1FB000
generic.menu.FlashSize.4M=4M (3M SPIFFS)
generic.menu.FlashSize.4M.build.flash_size=4M
generic.menu.FlashSize.4M.build.flash_ld=eagle.flash.4m.ld
generic.menu.FlashSize.4M.build.spiffs_start=0x100000
generic.menu.FlashSize.4M.build.spiffs_end=0x3FB000
generic.menu.FlashSize.8M=8M (7M SPIFFS)
generic.menu.FlashSize.8M.build.flash_size=1M
generic.menu.FlashSize.8M.build.flash_ld=eagle.flash.8m.ld
generic.menu.FlashSize.8M.build.spiffs_start=0x100000
generic.menu.FlashSize.8M.build.spiffs_end=0x800000
generic.menu.FlashSize.16M=16M (15M SPIFFS)
generic.menu.FlashSize.16M.build.flash_size=1M
generic.menu.FlashSize.16M.build.flash_ld=eagle.flash.16m.ld
generic.menu.FlashSize.16M.build.spiffs_start=0x100000
generic.menu.FlashSize.16M.build.spiffs_end=0x1000000

# generic.menu.FlashFreq.40=40MHz
# generic.menu.FlashFreq.40.build.flash_freq=40
# generic.menu.FlashFreq.80=80MHz
# generic.menu.FlashFreq.80.build.flash_freq=80

##############################################################
TSOC-ESP8266.name=TSOC-ESP8266 (PatternAgents thingSoC)

TSOC-ESP8266.upload.tool=esptool
TSOC-ESP8266.upload.speed=115200
TSOC-ESP8266.upload.resetmethod=ck
TSOC-ESP8266.upload.maximum_size=524288
TSOC-ESP8266.upload.wait_for_upload_port=true
TSOC-ESP8266.serial.disableDTR=true
TSOC-ESP8266.serial.disableRTS=true

TSOC-ESP8266.build.mcu=esp8266
TSOC-ESP8266.build.f_cpu=80000000L
TSOC-ESP8266.build.board=ESP8266_ESP01
TSOC-ESP8266.build.core=esp8266
TSOC-ESP8266.build.variant=TSOC-ESP8266
TSOC-ESP8266.build.flash_mode=qio
TSOC-ESP8266.build.flash_size=512K
TSOC-ESP8266.build.flash_freq=40
TSOC-ESP8266.build.flash_ld=eagle.flash.512k.ld
TSOC-ESP8266.build.spiffs_start=0x6B000
TSOC-ESP8266.build.spiffs_end=0x7B000

TSOC-ESP8266.menu.CpuFrequency.80=80 MHz
TSOC-ESP8266.menu.CpuFrequency.80.build.f_cpu=80000000L
TSOC-ESP8266.menu.CpuFrequency.160=160 MHz
TSOC-ESP8266.menu.CpuFrequency.160.build.f_cpu=160000000L

TSOC-ESP8266.menu.UploadSpeed.115200=115200
TSOC-ESP8266.menu.UploadSpeed.115200.upload.speed=115200
TSOC-ESP8266.menu.UploadSpeed.9600=9600
TSOC-ESP8266.menu.UploadSpeed.9600.upload.speed=9600
TSOC-ESP8266.menu.UploadSpeed.57600=57600
TSOC-ESP8266.menu.UploadSpeed.57600.upload.speed=57600
TSOC-ESP8266.menu.UploadSpeed.256000.windows=256000
TSOC-ESP8266.menu.UploadSpeed.256000.upload.speed=256000
TSOC-ESP8266.menu.UploadSpeed.230400.linux=230400
TSOC-ESP8266.menu.UploadSpeed.230400.macosx=230400
TSOC-ESP8266.menu.UploadSpeed.230400.upload.speed=230400
TSOC-ESP8266.menu.UploadSpeed.460800.linux=460800
TSOC-ESP8266.menu.UploadSpeed.460800.macosx=460800
TSOC-ESP8266.menu.UploadSpeed.460800.upload.speed=460800
TSOC-ESP8266.menu.UploadSpeed.512000.windows=512000
TSOC-ESP8266.menu.UploadSpeed.512000.upload.speed=512000
TSOC-ESP8266.menu.UploadSpeed.921600=921600
TSOC-ESP8266.menu.UploadSpeed.921600.upload.speed=921600
TSOC-ESP8266.menu.UploadSpeed.1843200=1843200
TSOC-ESP8266.menu.UploadSpeed.1843200.upload.speed=1843200

TSOC-ESP8266.menu.FlashSize.512K=512K (64K SPIFFS)
TSOC-ESP8266.menu.FlashSize.512K.build.flash_size=512K
TSOC-ESP8266.menu.FlashSize.512K.build.flash_ld=eagle.flash.512k.ld
TSOC-ESP8266.menu.FlashSize.512K.build.spiffs_start=0x6B000
TSOC-ESP8266.menu.FlashSize.512K.build.spiffs_end=0x7B000
TSOC-ESP8266.menu.FlashSize.1M512=1M (512K SPIFFS)
TSOC-ESP8266.menu.FlashSize.1M512.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
TSOC-ESP8266.menu.FlashSize.1M512.build.spiffs_start=0x6B000
TSOC-ESP8266.menu.FlashSize.1M512.build.spiffs_end=0xFB000
TSOC-ESP8266.menu.FlashSize.1M256=1M (256K SPIFFS)
TSOC-ESP8266.menu.FlashSize.1M256.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
TSOC-ESP8266.menu.FlashSize.1M256.build.spiffs_start=0xAB000
TSOC-ESP8266.menu.FlashSize.1M256.build.spiffs_end=0xFB000
TSOC-ESP8266.menu.FlashSize.1M128=1M (128K SPIFFS)
TSOC-ESP8266.menu.FlashSize.1M128.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
TSOC-ESP8266.menu.FlashSize.1M128.build.spiffs_start=0xCB000
TSOC-ESP8266.menu.FlashSize.1M128.build.spiffs_end=0xFB000
TSOC-ESP8266.menu.FlashSize.1M64=1M (64K SPIFFS)
TSOC-ESP8266.menu.FlashSize.1M64.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
TSOC-ESP8266.menu.FlashSize.1M64.build.spiffs_start=0xEB000
TSOC-ESP8266.menu.FlashSize.1M64.build.spiffs_end=0xFB000
TSOC-ESP8266.menu.FlashSize.2M=2M (1M SPIFFS)
TSOC-ESP8266.menu.FlashSize.2M.build.flash_size=2M
TSOC-ESP8266.menu.FlashSize.2M.build.flash_ld=eagle.flash.2m.ld
TSOC-ESP8266.menu.FlashSize.2M.build.spiffs_start=0x100000
TSOC-ESP8266.menu.FlashSize.2M.build.spiffs_end=0x1FB000
TSOC-ESP8266.menu.FlashSize.4M=4M (3M SPIFFS)
TSOC-ESP8266.menu.FlashSize.4M.build.flash_size=4M
TSOC-ESP8266.menu.FlashSize.4M.build.flash_ld=eagle.flash.4m.ld
TSOC-ESP8266.menu.FlashSize.4M.build.spiffs_start=0x100000
TSOC-ESP8266.menu.FlashSize.4M.build.spiffs_end=0x3FB000
TSOC-ESP8266.menu.FlashSize.8M=8M (7M SPIFFS)
TSOC-ESP8266.menu.FlashSize.8M.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.8M.build.flash_ld=eagle.flash.8m.ld
TSOC-ESP8266.menu.FlashSize.8M.build.spiffs_start=0x100000
TSOC-ESP8266.menu.FlashSize.8M.build.spiffs_end=0x800000
TSOC-ESP8266.menu.FlashSize.16M=16M (15M SPIFFS)
TSOC-ESP8266.menu.FlashSize.16M.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.16M.build.flash_ld=eagle.flash.16m.ld
TSOC-ESP8266.menu.FlashSize.16M.build.spiffs_start=0x100000
TSOC-ESP8266.menu.FlashSize.16M.build.spiffs_end=0x1000000

# TSOC-ESP8266.menu.FlashFreq.40=40MHz
# TSOC-ESP8266.menu.FlashFreq.40.build.flash_freq=40
# TSOC-ESP8266.menu.FlashFreq.80=80MHz
# TSOC-ESP8266.menu.FlashFreq.80.build.flash_freq=80